# Some Statistics with Baby Names

In [15]:
#check if notebook runs in colab
import sys
IN_COLAB = 'google.colab' in sys.modules
print('running in Colab:',IN_COLAB)
path='..'
if IN_COLAB:
  #in colab, we need to clone the data from the repo
  !git clone https://github.com/keuperj/DataScienceSS20.git
  path='DataScienceSS20'

running in Colab: False

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [16]:
import pandas as pd

### Step 2. 
User ***Jupyter Lab*** to view ``path+"/DATA/US_Baby_Names_right.csv"'``.

### Step 3. Assign it to a variable called baby_names.

In [17]:
baby_names = pd.read_csv(path+'/DATA/US_Baby_Names_right.csv')
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

### Step 4. See the first 10 entries

In [18]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [19]:
# deletes Unnamed: 0
del baby_names['Unnamed: 0']

# deletes Unnamed: 0
del baby_names['Id']

baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Are there more male or female names in the dataset?

In [20]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [21]:
# group the data
names = baby_names.groupby("Name")

#have look at a group
names.get_group('Emma')

#Emma contains all entries a

         Name  Year Gender State  Count
0        Emma  2004      F    AK     62
205      Emma  2005      F    AK     49
418      Emma  2006      F    AK     49
644      Emma  2007      F    AK     41
838      Emma  2008      F    AK     51
...       ...   ...    ...   ...    ...
1013854  Emma  2010      F    WY     23
1013983  Emma  2011      F    WY     43
1014104  Emma  2012      F    WY     40
1014222  Emma  2013      F    WY     30
1014362  Emma  2014      F    WY     32

[566 rows x 5 columns]

### Step 8. How many different names exist in the dataset?

In [22]:
# as we have already grouped by the name, all the names are unique already. 
# get the length of names
len(names)

17632

### Step 9. What is the name with most occurrences?

In [23]:
#NOTE Nost occurrences is not the most used name, just the name that has the most entries (by Year and State in the table)
names.size().sort_values().tail(1)

Name
Riley    1112
dtype: int64

In [24]:
names.get_group('Riley')
# Riley wone, because it hase entries for male AND female for all states and years

          Name  Year Gender State  Count
33       Riley  2004      F    AK     17
255      Riley  2005      F    AK     13
530      Riley  2006      F    AK      8
669      Riley  2007      F    AK     17
871      Riley  2008      F    AK     17
...        ...   ...    ...   ...    ...
1015597  Riley  2010      M    WY     11
1015769  Riley  2011      M    WY     12
1015973  Riley  2012      M    WY      8
1016154  Riley  2013      M    WY      7
1016273  Riley  2014      M    WY     12

[1112 rows x 5 columns]

In [25]:
# her is the most popular name (counting children with this name)
names.Count.sum().sort_values().tail(1)

Name
Jacob    242874
Name: Count, dtype: int64

### Step 10. How many different names have the least occurrences?

In [27]:
print(names[names.Count == names.Count.min()])

KeyError: 'Columns not found: False'

### Step 11. What is the median name occurrence?

In [ ]:
names[names.Count == names.Count.median()]

### Step 12. What is the standard deviation of names?

In [ ]:
names.Count.std()

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [ ]:
names.describe()